tap "homebrew/bundle"
tap "homebrew/core"
tap "bats-core/bats-core"
tap "j5pu/cmd"
tap "j5pu/tap"


brew "bats-core"
brew "makeself"
brew "stow"
brew "bats-core/bats-core/bats-assert"
brew "bats-core/bats-core/bats-file"
brew "bats-core/bats-core/bats-support"

if RUBY_PLATFORM[/darwin/] && ! ENV["GITHUB_RUN_ID"]
  tap "caarlos0/tap"
  tap "dopplerhq/cli"
  tap "goreleaser/tap"
  tap "microsoft/git"
  # tap "homebrew/autoupdate"
  tap "homebrew/cask"
  tap "homebrew/cask-drivers"
  tap "homebrew/cask-fonts"
  tap "homebrew/cask-versions"
  tap "homebrew/command-not-found"
  tap "homebrew/services"
  tap "homebrew/test-bot"
  tap "mas-cli/tap"
  tap "mongodb/brew"
  brew "ack"
  brew "asciidoctor"
  brew "bash-completion@2"
  brew "bat"
  brew "brew-cask-completion"
  brew "bundler-completion"
  brew "cloudflare-wrangler"
  brew "coreutils"
  brew "direnv"
  brew "duf"
  brew "exiftool"
  brew "fzf"
  brew "gdm"  # required for install-python
  brew "gem-completion"
  brew "gh"
  brew "git"
  brew "gnupg"
  brew "go"
  brew "gpg"
  brew "grc"
  brew "htop"
  brew "hyperfine"
  brew "jq"
  brew "ipython"
  brew "m-cli"
  brew "makeself"
  brew "mas"
  brew "most"
  # brew "mpdecimal"  # required for install-python
  brew "nativefier"
  brew "ncdu"
  brew "nmap"
  brew "node"
  brew "npm"
  brew "openssh"
  brew "openssl@1.1"  # required for install-python
  brew "openjdk"
  brew "pip-completion"
  brew "python@3.10", link: true
  brew "qpdf"
  brew "rbenv"
  # brew "readline"  # required for install-python
  brew "rsync"
  brew "ruby-completion"
  brew "speedtest-cli"
  brew "sqlite"  # required for install-python
  brew "starship"
  brew "telnet"
  brew "tor", restart_service: true
  brew "tree"
  brew "vercel-cli"
  brew "vim"
  brew "watchman"
  brew "wget"
  brew "whalebrew"
  brew "xz"  # required for install-python

  brew "goreleaser/tap/nfpm"
  brew "caarlos0/tap/svu"
  brew "dopplerhq/cli/doppler"
  brew "mongodb/brew/mongodb-community", restart_service: true

  cask "appcleaner", quarantine: false
  cask "adobe-acrobat-reader", quarantine: false
  cask "adoptopenjdk", quarantine: false
  cask "autofirma", quarantine: false
  cask "beardedspice", quarantine: false
  cask "docker", quarantine: false
  cask "electron", quarantine: false
  cask "electrum", quarantine: false
  cask "firefox-developer-edition", quarantine: false
  cask "font-archivo-black", quarantine: false
  cask "font-lato", quarantine: false
  cask "font-nova-mono", quarantine: false
  cask "font-share-tech", quarantine: false
  cask "font-share-tech-mono", quarantine: false
  cask "font-jetbrains-mono-nerd-font", quarantine: false
  cask "google-chrome-canary", quarantine: false
  cask "iterm2", quarantine: false
  cask "linearmouse", quarantine: false  # mousefix
  cask "keka", quarantine: false
  cask "kekaexternalhelper", quarantine: false
  cask "keepingyouawake", quarantine: false
  cask "opera-developer", quarantine: false
  cask "paintbrush", quarantine: false
  cask "skype", quarantine: false
  cask "slack", quarantine: false
  cask "spotify", quarantine: false
  cask "telegram-desktop", quarantine: false
  cask "tor-browser", quarantine: false
  cask "whatsapp", quarantine: false
  # cask "microsoft/git/git-credential-manager-core", quarantine: false

  mas "Bear", id: 1091189122
  mas "HP Smart", id: 1474276998
  mas "Magnet", id: 441258766
  mas "WhatFont", id: 1437138382
end

if RUBY_PLATFORM[/darwin/]
  brew "bash"
  brew "dash"
  brew "parallel"
end

if RUBY_PLATFORM[/linux/]
  brew "ksh"
  brew "zsh"
end
