tap "homebrew/bundle"
tap "homebrew/core"

brew "makeself"
brew "stow"

if RUBY_PLATFORM[/darwin/] && ! ENV["GITHUB_RUN_ID"]
  tap "caarlos0/tap"
  tap "goreleaser/tap"
  tap "microsoft/git"
  # tap "homebrew/autoupdate"
  tap "homebrew/cask"
  tap "homebrew/cask-drivers"
  tap "homebrew/cask-fonts"
  tap "homebrew/cask-versions"
  tap "homebrew/command-not-found"
  tap "homebrew/services"
  tap "homebrew/test-bot"
  tap "mas-cli/tap"
  tap "mongodb/brew"
  brew "ack"
  brew "asdf"
  brew "bat"
  brew "brew-gem"
  brew "bundler-completion"
  brew "duf"
  brew "exiftool"
  brew "fabric"
  brew "fabric-completion"
  brew "fzf"
  brew "gdm"  # required for install-python
  brew "gem-completion"
  brew "gnupg"
  brew "go"
  brew "gpg"
  brew "gradle"
  brew "gradle-completion"
  brew "htop"
  brew "hyperfine"
  brew "m-cli"
  brew "makeself"
  brew "mas"
  # brew "mpdecimal"  # required for install-python
  brew "nativefier"
  brew "ncdu"
  brew "nmap"
  brew "node"
  brew "nodebrew"
  brew "npm"
  brew "openssl@1.1"  # required for install-python
  brew "openjdk"
  brew "packer"
  brew "packer-completion"
  brew "python@3.9", link: false
  brew "qpdf"
  brew "rake-completion"
  brew "rbenv"
  # brew "readline"  # required for install-python
  brew "rsync"
  brew "ruby-completion"
  brew "rustc-completion"
  brew "speedtest-cli"
  brew "sqlite"  # required for install-python
  brew "stormssh"
  brew "stormssh-completion"
  brew "telnet"
  brew "tor", restart_service: true
  brew "tree"
  brew "vim"
  brew "watchman"
  brew "xz"  # required for install-python
  brew "yarn"
  brew "yarn-completion"

  brew "goreleaser/tap/nfpm"
  brew "caarlos0/tap/svu"
  brew "mongodb/brew/mongodb-community", restart_service: true

  cask "appcleaner", quarantine: false
  cask "adobe-acrobat-reader", quarantine: false
  cask "adoptopenjdk", quarantine: false
  cask "autofirma", quarantine: false
  cask "beardedspice", quarantine: false
#   cask "docker", quarantine: false
  cask "electron", quarantine: false
  cask "electrum", quarantine: false
  cask "firefox-developer-edition", quarantine: false
  cask "font-archivo-black", quarantine: false
  cask "font-lato", quarantine: false
  cask "font-nova-mono", quarantine: false
  cask "font-share-tech", quarantine: false
  cask "font-share-tech-mono", quarantine: false
#   cask "font-jetbrains-mono-nerd-font", quarantine: false
  cask "google-chrome-canary", quarantine: false
#   cask "iterm2", quarantine: false
  cask "linearmouse", quarantine: false  # mousefix
  cask "keka", quarantine: false
  cask "kekaexternalhelper", quarantine: false
  cask "keepingyouawake", quarantine: false
  cask "opera-developer", quarantine: false
  cask "paintbrush", quarantine: false
  cask "skype", quarantine: false
  cask "slack", quarantine: false
  cask "spotify", quarantine: false
  cask "telegram-desktop", quarantine: false
  cask "tor-browser", quarantine: false
  cask "whatsapp", quarantine: false
  # cask "microsoft/git/git-credential-manager-core", quarantine: false

  mas "Bear", id: 1091189122
  mas "HP Smart", id: 1474276998
  mas "Magnet", id: 441258766
  mas "WhatFont", id: 1437138382
end

if RUBY_PLATFORM[/darwin/]
  brew "dash"
end

if RUBY_PLATFORM[/linux/]
  brew "ksh"
  brew "zsh"
end
